START_TEXT = "🌍 Это бот для поиска <b>Sentinel2 L2A</b> снимков по локации (адрес или координаты точки), радиусу удаления от точки и интервалу времени.\n\n" \
             "📄 Чтобы ознакомиться с инструкцией, введите <code>/guide</code>."

GUIDE_TEXT = "🌍 Это бот для поиска <b>Sentinel2 L2A</b> снимков.\n\n" \
             \
             "<u>Для получения снимка необходимо по шагам ввести:</u>\n\n" \
             \
             "   1️⃣ <b>Локацию</b>. Например:\n" \
             "   • Общее название - <code>РТУ МИРЭА</code>\n" \
             "   • Адрес - <code>Москва, просп. Вернадского, 78, стр. 4</code>\n" \
             "   • Координаты точки - <code>55.669986, 37.480409</code>\n\n" \
             \
             "   2️⃣ <b>Радиус удаления</b> от точки в километрах <b>(0.1 - 50 км)</b>\n" \
             "   или нажать на кнопку <b>📍 5 км - по умолчанию</b>.\n\n" \
             \
             "   3️⃣ <b>Интервал времени</b> в формате:\n" \
             "   <code>ГГГГ-ММ-ДД ГГГГ-ММ-ДД</code>\n" \
             "   или нажать на кнопку <b>📅 2023-01-01 - сегодня</b>.\n" \
             "   ⚠️ Не раньше <code>2017-01-01</code> и не позже сегодняшней даты.\n\n" \
             \
             "<u>На любом шаге можно нажать кнопку <b>Отмена</b>, которая вернет всё в исходное состояние.</u>\n" \
             "После данных действий бот будет искать снимок по заданным критериям и информировать вас о процессе.\n\n" \
             "❗️ Для получения снимка на портале <a href='https://browser.dataspace.copernicus.eu/'>Copernicus Browser</a> перейдите по ссылке и зайдите на вкладку <b>Search</b>, " \
             "далее введите <b>Id</b> в поле <b>Search Criteria</b> и нажмите на кнопку <b>Search</b>."